{
  "blogDetail": {
    "title": "Talisker Bay on the Isle of Skye in Scotland",
    "subtitle": "Typography should be use:",
    "tag": "Digital Marketing",
    "blogImage1": "assets/images/blog/blog-details1.webp",
    "blogImage2": "assets/images/blog/blog11.webp",
    "blogImage3": "assets/images/blog/blog12.webp",
    "blogImage4": "assets/images/blog/blog-details4.webp",
    "text1": "A quick blog post from April 2020 started things off early, making the prediction that after our pandemic finally ends, we’d have a second Roaring ’20s. “100 years ago: An election, a virus and a cry from disillusioned youths,” ran a headline in the Washington Post in October for a story drawing suggestive comparisons between the two decades that are separated by a hundred years of history. As we limped into 2021, the comparisons picked up. “The 1920s Roared After a Pandemic, and the 2020s Will Try,” ran a Fun thoughts aside, however,",
    "text2": "Fun thoughts aside, however, my “hmm” reflex at historical comparisons is strong, and it’s been further honed by the “Is this fascism?” wars of 2016–21. At least one historian of the 1920s whom I reached out to for an interview for this piece said that the prediction of a “new ’20s” was so strained as to be not worth exploring. Steve LeVine, focusing on points of economic comparison in that piece in Marker, also thought: Probably not. LeVine points out a few key",
    "text3": "The “new ’20s” idea might not work—there were a lot more young people in the United States then than now; a reprise of the world-changing inventions and discoveries of the 1920s would be a big surprise to those economists who believe that we have been in an invention dry spell since the 1970s. In his Businessweek piece, Peter Coy largely agrees, writing, “In all probability",
    "text4": "Anyway, let’s get to that fun. A very joyful book to read about the decade is Frederick Lewis Allen’s Only Yesterday: An Informal History of the 1920s, which Allen—a blueblood journalist and editor at Harper’s—published in 1931. The book chronicles all of the movement and motion that makes the decade sexy, and doesn’t seem to miss a fad. Among the fleeting obsessions Allen catalogs are “the sudden and overwhelming craze for Eskimo Pie” that made the price of",
    "text5": "I describe the “fun” parts of Only Yesterday because they’re wonderful, but also to make a point about the origin story we’ve learned about the mood of the ’20s. Looking back at Allen’s work from the vantage point of 1986, historian David M. Kennedy argued that the biggest failing of the book was its lack of historical depth: “Rarely did Allen forge an explanatory chain whose links ran back more deeply into the past than 1917.” And indeed, Allen seemed to blame World War I for every ash-covered carpet and scarred dining table. Young people who had been overseas and seen so much blood were not ready to conform, Allen wrote:",
    "text6": "Allen is also really good at describing parties—or, at least, the ones the middle class and upper class attended. The historian wrote about how women taking up smoking had “strewed the dinner table with their ashes, snatched a puff between the acts, invaded the masculine sanctity of the club car, and forced department stores to place ornamental ash-trays between the chairs in their women’s shoe departments.” In what I think may be the best passage in the book, Allen described the way 1920s partygoers stepped all over every previous genteel convention:",
    "text7": "Anyway, let’s get to that fun. A very joyful book to read about the decade is Frederick Lewis Allen’s Only Yesterday: An Informal History of the 1920s, which Allen—a blueblood journalist and editor at Harper’s—published in 1931. The book chronicles all of the movement and motion that makes the decade sexy, and doesn’t seem to miss a fad.",
    "text8": "Allen is also really good at describing parties—or, at least, the ones the middle class and upper class attended. The historian wrote about how women taking up smoking had “strewed the dinner table with their ashes, snatched a puff between the acts, invaded the masculine sanctity of the club car.",
    "quote": "A designer knows he has achieved perfection not when there is nothing left to add, but when there is nothing left to take away.",
    "postBy": {
      "name": "Angelina Jolly",
      "date": "12 February, 2022",
      "image": "assets/images/client1.webp"
    }
  }
}
